In [ ]:
##Handling Imbalanced Dataset

# 1. up sampling
# 2. Down Sampling

In [1]:
!pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\users\rajpu\appdata\roaming\python\python310\site-packages (2.2.6)

WARNING: You are using pip version 21.2.3; however, version 25.3 is available.
You should consider upgrading via the 'C:\Program Files\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import numpy as nd
import pandas as pd

#set the random seed for reproducibility

nd.random.seed(123)

#create a dataframe with two classes
n_sample=1000
class_0_reatio=0.9
n_class_0=int(n_sample *class_0_reatio)
n_class_1=n_sample-n_class_0

In [3]:
n_class_0,n_class_1

(900, 100)

In [5]:
class_0=pd.DataFrame({
    
    'Name': ['Amit', 'Sneha', 'Rohit', 'Priya', 'Kunal'],
    'Age': [23, 21, 24, 22, 23],
    'City': ['Pune', 'Mumbai', 'Nagpur', 'Nashik', 'Kolhapur'],
    'Marks': [85, 90, 78, 88, 92]

})

class_1=pd.DataFrame({
    'Experience_Years': [1, 3, 5, 7, 2, 4, 6, 8],
    'Age': [22, 25, 28, 32, 24, 27, 30, 35],
    'Education_Level': ['Bachelors', 'Masters', 'Bachelors', 'PhD', 'Bachelors', 'Masters', 'Masters', 'PhD'],
    'Salary': [25000, 40000, 55000, 80000, 30000, 50000, 65000, 90000],
    'Promoted': [0, 0, 1, 1, 0, 1, 1, 1]  # Target column (0 = Not promoted, 1 = Promoted)
})

In [7]:
df=pd.concat([class_0,class_1]).reset_index(drop=True)

In [8]:
df

,Name,Age,City,Marks,Experience_Years,Education_Level,Salary,Promoted
0,Amit,23,Pune,85.0,NaN,NaN,NaN,NaN
1,Sneha,21,Mumbai,90.0,NaN,NaN,NaN,NaN
2,Rohit,24,Nagpur,78.0,NaN,NaN,NaN,NaN
3,Priya,22,Nashik,88.0,NaN,NaN,NaN,NaN
4,Kunal,23,Kolhapur,92.0,NaN,NaN,NaN,NaN
5,NaN,22,NaN,NaN,1.0,Bachelors,25000.0,0.0
6,NaN,25,NaN,NaN,3.0,Masters,40000.0,0.0
7,NaN,28,NaN,NaN,5.0,Bachelors,55000.0,1.0
8,NaN,32,NaN,NaN,7.0,PhD,80000.0,1.0
9,NaN,24,NaN,NaN,2.0,Bachelors,30000.0,0.0
10,NaN,27,NaN,NaN,4.0,Masters,50000.0,1.0
11,NaN,30,NaN,NaN,6.0,Masters,65000.0,1.0
12,NaN,35,NaN,NaN,8.0,PhD,90000.0,1.0

In [9]:
df.head()

,Name,Age,City,Marks,Experience_Years,Education_Level,Salary,Promoted
0,Amit,23,Pune,85.0,NaN,NaN,NaN,NaN
1,Sneha,21,Mumbai,90.0,NaN,NaN,NaN,NaN
2,Rohit,24,Nagpur,78.0,NaN,NaN,NaN,NaN
3,Priya,22,Nashik,88.0,NaN,NaN,NaN,NaN
4,Kunal,23,Kolhapur,92.0,NaN,NaN,NaN,NaN

In [10]:
df.tail()

   Name  Age City  Marks  Experience_Years Education_Level   Salary  Promoted
8   NaN   32  NaN    NaN               7.0             PhD  80000.0       1.0
9   NaN   24  NaN    NaN               2.0       Bachelors  30000.0       0.0
10  NaN   27  NaN    NaN               4.0         Masters  50000.0       1.0
11  NaN   30  NaN    NaN               6.0         Masters  65000.0       1.0
12  NaN   35  NaN    NaN               8.0             PhD  90000.0       1.0

In [13]:
df['Age'].value_counts()

Age
23    2
24    2
22    2
21    1
25    1
28    1
32    1
27    1
30    1
35    1
Name: count, dtype: int64